<?php

return [

	/*
	|--------------------------------------------------------------------------
	| Правила для конвертации ассетов
	|--------------------------------------------------------------------------
	| ключ массива - имя файла.
	| значение - массив с параметрами для преобразования в формате Glide
	|
	|
	| default - параметры, применяемые ко всем остальным правилам.
	|           Могут быть переопределены в отдельном правиле.
	|
	*/
	
	'default' => [
		'fm' => 'jpg'
	],

	'big' => [
		'w' => 1024,
		'h' => 1024
	],

	'thumb' => [
		'w' => 500,
		'h' => 500
	],
	
	'thumb-square' => [
		'w' => 500,
		'h' => 500,
		'fit' => 'crop-center'
	],

];